# Tratamento dos dados ausentes.

In [1]:
import pandas as pd
import numpy as np

In [4]:
dataFrame = {
    'J' : [10, 20, np.nan],
    'E' : [40, np.nan, np.nan],
    'F' : [np.nan, 50, np.nan]
}

In [5]:
dataFrame

{'J': [10, 20, nan], 'E': [40, nan, nan], 'F': [nan, 50, nan]}

In [7]:
df = pd.DataFrame(dataFrame)
df

      J     E     F
0  10.0  40.0   NaN
1  20.0   NaN  50.0
2   NaN   NaN   NaN

In [12]:
nv_id = 'R A Y'.split()
df['id'] = nv_id
df

      J     E     F id
0  10.0  40.0   NaN  R
1  20.0   NaN  50.0  A
2   NaN   NaN   NaN  Y

In [15]:
df.reset_index(inplace=True)
df.set_index('id', inplace=True)
df

    level_0  index     J     E     F
id
R         0      0  10.0  40.0   NaN
A         1      1  20.0   NaN  50.0
Y         2      2   NaN   NaN   NaN

In [23]:
#df.drop('level_0')
#df.drop('index', axis=1, inplace=True)
df.reset_index().set_index('id', inplace=True)
df

       J     E     F
id
R   10.0  40.0   NaN
A   20.0   NaN  50.0
Y    NaN   NaN   NaN

In [25]:
df

       J     E     F
id
R   10.0  40.0   NaN
A   20.0   NaN  50.0
Y    NaN   NaN   NaN

## Jogando fora os dados que de alguma forma foram corrompidos.
    Com a funçãp dropna.

In [26]:
df.dropna()

Empty DataFrame
Columns: [J, E, F]
Index: []

In [29]:
df.iloc[0,2] = 60
df

       J     E     F
id
R   10.0  40.0  60.0
A   20.0   NaN  50.0
Y    NaN   NaN   NaN

### Só retorna as linhas os os valores não estão corrompidos.

In [31]:
df.dropna()

       J     E     F
id
R   10.0  40.0  60.0

In [37]:
df

       J     E     F
id
R   10.0  40.0  60.0
A   20.0   NaN  50.0
Y    NaN   NaN   NaN

## Agora para preencher os valores, temos o método fillna('parâmetro = float, boll, etc..')

In [39]:
df.fillna('Python', inplace=True)
df

         J       E       F
id
R     10.0    40.0    60.0
A     20.0  Python    50.0
Y   Python  Python  Python